app/services/minesweeper_service.rb

UPDATE "game_boards" SET "board_data" = $1, "updated_at" = $2 WHERE "game_boards"."id" = $3  [["board_data", "[[-1,-1,2],[3,-1,2],[1,1,1]]"], ["updated_at", "2023-06-05 09:59:22.516044"], ["id", 5]]
---
  def save_board(board, record)
    record.update(board_data: board.to_json)