app/controllers/boards_controller.rb

SELECT "game_boards".* FROM "game_boards" ORDER BY "game_boards"."id" DESC LIMIT $1  [["LIMIT", 10]]
---
	def home
		@boards = GameBoard.last(10)

SELECT "game_boards".* FROM "game_boards" ORDER BY "game_boards"."created_at" DESC
SELECT COUNT(*) FROM "game_boards"
SELECT "game_boards".* FROM "game_boards" ORDER BY "game_boards"."created_at" DESC LIMIT $1 OFFSET $2  [["LIMIT", 30], ["OFFSET", 0]]
---
	def index
		@boards = GameBoard.paginate(page: params[:page], per_page: 5).order(created_at: :desc)
		@boards = @boards.search(params[:search]) if params[:search].present?

INSERT INTO "game_boards" ("email", "mines", "height", "width", "board_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["email", "FOR@gmail.com"], ["mines", 9], ["height", 3], ["width", 3], ["board_name", "dsd"], ["created_at", "2023-06-05 12:25:42.404999"], ["updated_at", "2023-06-05 12:25:42.404999"]]
---
	def create
		@board = GameBoard.new(board_params)
		if @board.save

DELETE FROM "game_boards" WHERE "game_boards"."id" = $1  [["id", 12]]
---
	def destroy
		if @board.destroy

SELECT "game_boards".* FROM "game_boards" WHERE "game_boards"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
---
	def set_board
		@board = GameBoard.find_by(id: params[:id])